/*
*********************************************************************************************************
*
*	模块名称 : 串口驱动模块
*	文件名称 : bsp_uart.h
*	版    本 : V1.0
*	说    明 : 头文件，配合新建工程使用，非完整文件
*
*
*
*********************************************************************************************************
*/
#ifndef	_BSP_UART_H
#define _BSP_UART_H

#include "sys.h"

///////////////////////////////////////////////////////////
//移植修改区
//按照实际端口修改
//较前版本更加容易移植(注意，端口仅仅适用于非JTAG/SWD引脚，如果是JTAG引脚，需要打开AFIO时钟，并失能JTAG)



/////////////////////////////////////////////////////////////////////////////////////////////////


//IO操作函数	 



/* 供外部调用的函数声明 */

#define USART_REC_LEN	1024	//定义最大接收字节数1024
#define	EN_USART1_RX	1		//使能（1）/禁止（0） 串口1接收

extern uint8_t USART_RX_BUF[USART_REC_LEN];			//接收缓冲，最大USART_REC-LEN个字节，末字节为换行符	
extern uint8_t ReceiveState;						//接收状态标记
extern uint16_t RxCounter;

void bsp_InitUart1(uint32_t baud);

#if EN_USART1_RX		//如果使能了接收

void Uart0_STA_Clr(void);

#endif
void USART1_Send_Data(uint8_t *buf,uint8_t len);


#endif



/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
