/*
*********************************************************************************************************
*
*	模块名称 : LED指示灯驱动模块
*	文件名称 : bsp_beep.c
*	版    本 : V1.0
*	说    明 : 驱动LED指示灯，配合新建工程使用，非完整文件
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2023-04-19  刘斌  正式发布
*
*	
*
*********************************************************************************************************
*/

#include "bsp.h"
/*
*********************************************************************************************************
*	函 数 名: bsp_InitBeep
*	功能说明: 配置LED指示灯相关的GPIO,  该函数被 bsp_Init() 调用。
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitBeep(void)
{
	 GPIO_InitTypeDef GPIO_InitStructure;
	/*打开GPIO时钟*/
	RCC_APB2PeriphClockCmd(RCC_ALL_BEEP,ENABLE);
	/*配置蜂鸣器GPIO为推挽输出模式
   由于将GPIO设置为输出时，GPIO输出寄存器的值缺省是0，不会驱动蜂鸣器鸣叫	
	*/
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
	GPIO_Init(BEEP_GPIO_PORT,&GPIO_InitStructure);
	
	
}
/*
*********************************************************************************************************
*	函 数 名: bsp_BeepOn
*	功能说明: 配置LED指示灯相关的GPIO,  该函数被 bsp_Init() 调用。
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepOn(void)
{
  BEEP =1;
	
}
/*
*********************************************************************************************************
*	函 数 名: bsp_InitBeep
*	功能说明: 配置LED指示灯相关的GPIO,  该函数被 bsp_Init() 调用。
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepOff(void)
{
	BEEP = 0;
}
/*
*********************************************************************************************************
*	函 数 名: bsp_InitBeep
*	功能说明: 配置LED指示灯相关的GPIO,  该函数被 bsp_Init() 调用。
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepToggle(void)
{
  BEEP_GPIO_PORT->ODR^=BEEP_GPIO_PIN;
}
/*
*********************************************************************************************************
*	函 数 名: bsp_InitBeep
*	功能说明: 配置LED指示灯相关的GPIO,  该函数被 bsp_Init() 调用。
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
uint8_t bsp_IsBeepOn(void)
{
	if((BEEP_GPIO_PORT->ODR&BEEP_GPIO_PIN) == BEEP_GPIO_PIN)
	{
		return 1;
		
	}
	return 0;
}
